# Process of cleaning 2010 trip history data

**Load dependencies and data set**

In [1]:
import numpy as np
import pandas as pd
import datetime

nr_2010_old = nr_2010 = pd.read_csv("~/Projects/NiceRide/Nice_Ride_data/2010/Nice_Ride_trip_history_2010_season.csv")
# can't coerce "dtype = {'End terminal':np.int32, 'Total duration (ms)':np.int32})" due to NaN values

**Check how data loaded, and row count**

In [2]:
print(nr_2010.count())
nr_2010.head(1) # Discrepancy shows NaN values

Start date             101851
Start station          101851
Start terminal         101851
End date               101428
End station            101426
End terminal           101426
Total duration (ms)    101428
Account type           101851
dtype: int64

,Start date,Start station,Start terminal,End date,End station,End terminal,Total duration (ms),Account type
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000.0,8018.0,Casual

**Another method checking if Dataframe has any NaN and where they are located**

In [3]:
nr_2010.isnull().sum()
# A boolean variation :
# nr_2010.isnull().any()

Start date               0
Start station            0
Start terminal           0
End date               423
End station            425
End terminal           425
Total duration (ms)    423
Account type             0
dtype: int64

**NaN removal**

In [4]:
nr_2010 = nr_2010.dropna()

In [5]:
nr_2010.count()
# Notice how all the columns are now equal

Start date             101426
Start station          101426
Start terminal         101426
End date               101426
End station            101426
End terminal           101426
Total duration (ms)    101426
Account type           101426
dtype: int64

In [6]:
nr_2010.isnull().sum()
# Looking good

Start date             0
Start station          0
Start terminal         0
End date               0
End station            0
End terminal           0
Total duration (ms)    0
Account type           0
dtype: int64

** Renaming terminal columns for legibility**

In [7]:
nr_2010.head(3)

,Start date,Start station,Start terminal,End date,End station,End terminal,Total duration (ms),Account type
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000.0,8018.0,Casual
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042.0,963762.0,Casual
2,6/10/2010 21:15,100 Main Street SE,30000,6/10/2010 21:27,11th Street & Hennepin,30004.0,717079.0,Casual

In [8]:
# .rename doesn't mutate original Dataframe unless it's assigned
nr_2010 = nr_2010.rename(index=str, columns={"Start terminal": "Start station ID",
                                             "End terminal": "End station ID"})

In [9]:
nr_2010.head(3)

,Start date,Start station,Start station ID,End date,End station,End station ID,Total duration (ms),Account type
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000.0,8018.0,Casual
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042.0,963762.0,Casual
2,6/10/2010 21:15,100 Main Street SE,30000,6/10/2010 21:27,11th Street & Hennepin,30004.0,717079.0,Casual

**Addressing dtype of End Terminal**

In [10]:
nr_2010['End station ID'] = nr_2010['End station ID'].astype(int)

In [11]:
nr_2010.head(2)
# Everything looks good!

,Start date,Start station,Start station ID,End date,End station,End station ID,Total duration (ms),Account type
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000,8018.0,Casual
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042,963762.0,Casual

**Changing Total duration to integer, seconds, and renaming to identify changes**

In [12]:
nr_2010['Total duration (seconds)'] = round(nr_2010['Total duration (ms)'] * .001).astype(int)

In [13]:
nr_2010.head(2)

,Start date,Start station,Start station ID,End date,End station,End station ID,Total duration (ms),Account type,Total duration (seconds)
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000,8018.0,Casual,8
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042,963762.0,Casual,964

In [14]:
del nr_2010['Total duration (ms)']
# Removal of old column

**Checking Account type column to ensure only 2 classifications**

In [15]:
nr_2010['Account type'].value_counts()

Casual     52521
Member     48853
Unknown       52
Name: Account type, dtype: int64

**Removing the unknown member type**

In [16]:
nr_2010 = nr_2010.loc[~(nr_2010['Account type'] == 'Unknown')]
nr_2010['Account type'].value_counts()

Casual    52521
Member    48853
Name: Account type, dtype: int64

**Cleaning complete, (original data set as reference)**

In [17]:
nr_2010.head(4)

,Start date,Start station,Start station ID,End date,End station,End station ID,Account type,Total duration (seconds)
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000,Casual,8
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042,Casual,964
2,6/10/2010 21:15,100 Main Street SE,30000,6/10/2010 21:27,11th Street & Hennepin,30004,Casual,717
3,6/11/2010 13:52,100 Main Street SE,30000,6/11/2010 14:42,Washington & 2nd Ave N,30021,Casual,2966

In [18]:
nr_2010_old.head(4)

,Start date,Start station,Start terminal,End date,End station,End terminal,Total duration (ms),Account type
0,6/10/2010 8:01,100 Main Street SE,30000,6/10/2010 8:01,100 Main Street SE,30000.0,8018.0,Casual
1,6/10/2010 17:38,100 Main Street SE,30000,6/10/2010 17:54,IDS Center,30042.0,963762.0,Casual
2,6/10/2010 21:15,100 Main Street SE,30000,6/10/2010 21:27,11th Street & Hennepin,30004.0,717079.0,Casual
3,6/11/2010 13:52,100 Main Street SE,30000,6/11/2010 14:42,Washington & 2nd Ave N,30021.0,2966016.0,Casual

In [19]:
# Save to file
nr_2010.to_csv("~/Projects/NiceRide/Nice_Ride_data/2010/NiceRide_trip_history_2010.csv")